##### Loading Data:
Load a CSV file into a Pandas DataFrame.

Read an Excel file and display the first five rows.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('exercise\Salaries.csv')

In [3]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [5]:
df = df.drop(columns = {'OvertimePay','OtherPay','Benefits', 'TotalPayBenefits', 'Year', 'Notes', 'Agency','Status'})

In [6]:
df

,Id,EmployeeName,JobTitle,BasePay,TotalPay
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,538909.28
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,335279.91
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,332343.61
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,326373.19
...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00
148650,148651,Not provided,Not provided,NaN,0.00
148651,148652,Not provided,Not provided,NaN,0.00
148652,148653,Not provided,Not provided,NaN,0.00
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,-618.13

##### Data Exploration:
Check the shape of the DataFrame.

Display basic statistics of the dataset.

In [7]:
df.shape

(148654, 5)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Id            148654 non-null  int64
 1   EmployeeName  148654 non-null  object
 2   JobTitle      148654 non-null  object
 3   BasePay       148045 non-null  float64
 4   TotalPay      148654 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 5.7+ MB

In [9]:
df.describe()

                  Id        BasePay       TotalPay
count  148654.000000  148045.000000  148654.000000
mean    74327.500000   66325.448840   74768.321972
std     42912.857795   42764.635495   50517.005274
min         1.000000    -166.010000    -618.130000
25%     37164.250000   33588.200000   36168.995000
50%     74327.500000   65007.450000   71426.610000
75%    111490.750000   94691.050000  105839.135000
max    148654.000000  319275.010000  567595.430000

##### Indexing and Selecting Data:
    
Select a single column from the DataFrame.

Select rows based on a condition.

In [10]:
df['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [11]:
#Employees whose Basepay is greater than average base pay
df[df['BasePay'] > df['BasePay'].mean()][['EmployeeName','BasePay']]

              EmployeeName    BasePay
0           NATHANIEL FORD  167411.18
1             GARY JIMENEZ  155966.02
2           ALBERT PARDINI  212739.13
3        CHRISTOPHER CHONG   77916.00
4          PATRICK GARDNER  134401.60
...                    ...        ...
136853          Mikel Jaye   68350.33
136874        Carol A Bird   69226.50
136970    Thomas R Shawyer   67330.14
136988  Dolores A Blanding   67092.13
137068      Byron P Morgan   66429.26

[70575 rows x 2 columns]

###### Data Cleaning:
Remove duplicate rows from the DataFrame.

Fill missing values in a specific column with the mean.

In [12]:
df.isna().sum()

Id                0
EmployeeName      0
JobTitle          0
BasePay         609
TotalPay          0
dtype: int64

In [13]:
df['BasePay'].fillna(df['BasePay'].mean(),inplace = True)

In [14]:
df['BasePay'].isnull().sum()

0

In [15]:
df['BasePay'].duplicated().sum()

39164

In [16]:
df['BasePay'].drop_duplicates(inplace=True)

###### Data Manipulation:
Create a new column based on existing columns.

Rename a column in the DataFrame.

In [17]:
df['updated_basePay'] = df['BasePay'] * 10

In [18]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'TotalPay',
       'updated_basePay'],
      dtype='object')

In [19]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,TotalPay,updated_basePay
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,567595.43,1674111.8
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,538909.28,1559660.2
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,335279.91,2127391.3
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,332343.61,779160.0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,326373.19,1344016.0

In [20]:
df.rename(columns={'EmployeeName':'Name'}, inplace = True)

In [21]:
df

,Id,Name,JobTitle,BasePay,TotalPay,updated_basePay
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18000,567595.43,1.674112e+06
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02000,538909.28,1.559660e+06
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13000,335279.91,2.127391e+06
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00000,332343.61,7.791600e+05
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60000,326373.19,1.344016e+06
...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00000,0.00,0.000000e+00
148650,148651,Not provided,Not provided,66325.44884,0.00,6.632545e+05
148651,148652,Not provided,Not provided,66325.44884,0.00,6.632545e+05
148652,148653,Not provided,Not provided,66325.44884,0.00,6.632545e+05
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00000,-618.13,0.000000e+00

##### Grouping and Aggregation:
Group data by a specific column and calculate the mean.

Aggregate multiple statistics at once using groupby.

In [22]:
df['Name'].duplicated().sum()

37843

In [23]:
df.groupby('Name').count()['Id']

Name
A BERNARD FATOOH         1
A Bernard  Fatooh        1
A Bernard Fatooh         2
A ELIZABETH MARCHASIN    1
A JAMIL NIAZI            1
                        ..
Zun Jin Zhang He         2
Zuna Luu                 1
Zuna T Luu               2
Zuri  Jones              1
Zuri Jones               2
Name: Id, Length: 110811, dtype: int64

In [24]:
#Average of Base pay & total Pay per different job titles
df.groupby('JobTitle').mean()[['BasePay','TotalPay']]

C:\Users\pavan\AppData\Local\Temp\ipykernel_52684\2862917708.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('JobTitle').mean()[['BasePay','TotalPay']]

                                                     BasePay      TotalPay
JobTitle
ACCOUNT CLERK                                   43300.806506  44035.664337
ACCOUNTANT                                      46643.172000  47429.268000
ACCOUNTANT INTERN                               28732.663958  29031.742917
ACPO,JuvP, Juv Prob (SFERS)                     62290.780000  62290.780000
ACUPUNCTURIST                                   66374.400000  67594.400000
...                                                      ...           ...
X-RAY LABORATORY AIDE                           47664.773077  52705.880385
X-Ray Laboratory Aide                           46086.387100  50823.942700
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS  52609.910000  53632.870000
Youth Comm Advisor                              39077.957500  41414.307500
ZOO CURATOR                                     43148.000000  66686.560000

[2159 rows x 2 columns]

###### Merging DataFrames:
Merge two DataFrames using a common key.

Concatenate two DataFrames vertically.

In [25]:
df1 = df[['Name','JobTitle']]

In [26]:
df1

                     Name                                        JobTitle
0          NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1            GARY JIMENEZ                 CAPTAIN III (POLICE DEPARTMENT)
2          ALBERT PARDINI                 CAPTAIN III (POLICE DEPARTMENT)
3       CHRISTOPHER CHONG            WIRE ROPE CABLE MAINTENANCE MECHANIC
4         PATRICK GARDNER    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
...                   ...                                             ...
148649      Roy I Tillery                                       Custodian
148650       Not provided                                    Not provided
148651       Not provided                                    Not provided
148652       Not provided                                    Not provided
148653          Joe Lopez                      Counselor, Log Cabin Ranch

[148654 rows x 2 columns]

In [27]:
df2 = df[['JobTitle','BasePay','TotalPay']]

In [28]:
df2

,JobTitle,BasePay,TotalPay
0,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18000,567595.43
1,CAPTAIN III (POLICE DEPARTMENT),155966.02000,538909.28
2,CAPTAIN III (POLICE DEPARTMENT),212739.13000,335279.91
3,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00000,332343.61
4,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60000,326373.19
...,...,...,...
148649,Custodian,0.00000,0.00
148650,Not provided,66325.44884,0.00
148651,Not provided,66325.44884,0.00
148652,Not provided,66325.44884,0.00
148653,"Counselor, Log Cabin Ranch",0.00000,-618.13

In [29]:
merged_df = pd.merge(df1,df2,on='JobTitle')

In [30]:
merged_df

,Name,JobTitle,BasePay,TotalPay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18000,567595.43
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,230827.12000,230827.12
2,EDWARD REISKIN,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18000,567595.43
3,EDWARD REISKIN,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,230827.12000,230827.12
4,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02000,538909.28
...,...,...,...,...
166301803,Not provided,Not provided,66325.44884,0.00
166301804,Not provided,Not provided,66325.44884,0.00
166301805,Not provided,Not provided,66325.44884,0.00
166301806,Not provided,Not provided,66325.44884,0.00
166301807,Not provided,Not provided,66325.44884,0.00

In [31]:
data1 = pd.DataFrame({'Keys': [1,2,3,4],
                     'value1':[5,6,7,8]})

In [32]:
data2 = pd.DataFrame({'Keys': [1,2,3,4],
                     'value2':[55,46,27,18]})

In [33]:
data = pd.concat([data1,data2])

In [34]:
data

   Keys  value1  value2
0     1     5.0     NaN
1     2     6.0     NaN
2     3     7.0     NaN
3     4     8.0     NaN
0     1     NaN    55.0
1     2     NaN    46.0
2     3     NaN    27.0
3     4     NaN    18.0

###### Time Series Operations:
Convert a column with date strings to a datetime object.

Set the datetime column as the index.

In [35]:
df['DateColumn'] = pd.to_datetime('now')

C:\Users\pavan\AppData\Local\Temp\ipykernel_52684\1853823669.py:1: FutureWarning: The parsing of 'now' in pd.to_datetime without `utc=True` is deprecated. In a future version, this will match Timestamp('now') and Timestamp.now()
  df['DateColumn'] = pd.to_datetime('now')

In [36]:
df['datecolumn1'] = pd.to_datetime(df['Year'])

KeyError: 'Year'

In [ ]:
df

In [ ]:
df.set_index('DateColumn')

###### Visualization with Pandas:
Plot a specific column as a bar chart.

Create a line plot of a time series.

In [ ]:
df.plot('JobTitle','BasePay')

In [ ]:
df.plot.bar('TotalPay')

###### Advanced Indexing:
Use boolean indexing with multiple conditions.

Set hierarchical indexing on a DataFrame.

In [ ]:
df['OvertimePay'].fillna(0,inplace=True)

In [ ]:
round(df['OvertimePay']).astype(int)

In [ ]:
df['BasePay'].astype(int)

In [ ]:
(df['BasePay'].astype(int)) & (round(df['OvertimePay']).astype(int))

In [ ]:
df['index'] = (df['BasePay'].astype(int) & df['OvertimePay'].round().astype(int))

In [ ]:
df.set_index('index')

In [ ]:
df.set_index(['index','Id'])

###### Reshaping Data:
Pivot the DataFrame to reshape the data.

Convert a wide DataFrame to a long format.

In [ ]:
data = {'value':range(12),
       'variable1': ["A"] * 3 + ["B"] * 3 + ["C"] * 3 + ["D"] * 3,
       'variable2':['X','Y','Z']*4}

In [ ]:
data_df = pd.DataFrame(data)

In [ ]:
data_df

In [ ]:
data2_df = data_df.pivot(index = 'variable1',columns ='variable2' , values='value')

In [ ]:
data2_df

In [ ]:
pd.melt(data2_df, id_vars='X', value_vars=['Y', 'Z'])

###### Working with Strings:
Create a new column with the length of strings.

Extract a substring from a column.

In [ ]:
df['length_of_name']=df.Name.apply(lambda x:len(x))

In [ ]:
df

In [ ]:
df['first_name']=df['Name'].apply(lambda x:x.split(' ')[0])

###### Handling Outliers:
Identify and remove outliers from a numeric column.

Replace outliers with a predefined threshold.

In [ ]:
import seaborn as sns

In [ ]:
sns.distplot(df['BasePay'])

In [ ]:
df['BasePay'].isnull().sum()

In [ ]:
figure = df.boxplot(column='BasePay')

In [ ]:
df['BasePay'].describe()

In [ ]:
upper_boundary = df['BasePay'].mean() + 3 * df['BasePay'].std()
lower_boundary = df['BasePay'].mean() - 3 * df['BasePay'].std()

In [ ]:
print(upper_boundary)
print(lower_boundary)
print(df['BasePay'].mean())

###### Datetime Operations:
Extract day, month, and year from a datetime column.

Calculate the time difference between two dates.

###### Combining DataFrames:
Merge two DataFrames using an outer join.

Concatenate DataFrames along columns.

###### Rolling Statistics:
Calculate a rolling mean of a column.

Apply a custom function using a rolling window.

###### Saving Data:
Save the DataFrame to a new CSV file.

Save the DataFrame to an Excel file.

In [ ]:
df.to_excel('Sampleexcel.xlsx')

In [ ]:
df.to_csv('samplecsv.csv')